artillery/scenario-echo.yaml
version: 1
config:
  target: "http://localhost:3000"
  http:
    pool: 10
  phases:
    - duration: 60
      arrivalRate: 2500
  processor: "./processor.js"
scenarios:
  - flow:
      - post:
          url: "/polls/leaderboard/echo"
          json:
            organizationId: "6911691355886452736"
            eventId: "644"