artillery/scenario-listjs.yaml
version: 1
config:
  target: "http://{{ $processEnvironment.HOST }}:3000"
  http:
    pool: 100
  phases:
    - duration: {{ $processEnvironment.DURATION }}
      arrivalCount: {{ $processEnvironment.COUNT }}
  processor: "./processor.js"
scenarios:
  - flow:
      - post:
          url: "/polls/leaderboard/listjs"
          json:
            organizationId: "6911691355886452736"
            eventId: "644"
            pagination:
              page: "{{ page }}"
              pageSize: "{{ pageSize }}"
          beforeRequest: "generateRandomPagination"